placeholder/dbl_0_58_29_8/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];


internalField   nonuniform List<vector> 
6502
(
(0.01 1.4875 -0.005)
(0.03 1.4875 -0.005)
(0.05 1.4875 -0.005)
(0.07 1.4875 -0.005)
(0.09 1.4875 -0.005)
(0.11 1.4875 -0.005)
(0.13 1.4875 -0.005)
(0.15 1.4875 -0.005)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 10((0.01 1.5 -0.005) (0.03 1.5 -0.005) (0.05 1.5 -0.005) (0.07 1.5 -0.005) (0.09 1.5 -0.005) (0.11 1.5 -0.005) (0.13 1.5 -0.005) (0.15 1.5 -0.005) (0.17 1.5 -0.005) (0.19 1.5 -0.005));
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 10((2.81 1.5 -0.005) (2.83 1.5 -0.005) (2.85 1.5 -0.005) (2.87 1.5 -0.005) (2.89 1.5 -0.005) (2.91 1.5 -0.005) (2.93 1.5 -0.005) (2.95 1.5 -0.005) (2.97 1.5 -0.005) (2.99 1.5 -0.005));
    }
    walls
    {
        type            calculated;
        value           nonuniform List<vector> 
446
(
(0 1.4875 -0.005)
(0 1.4625 -0.005)
(0 1.4375 -0.005)
(0 1.4125 -0.005)
(0 1.3875 -0.005)
(0 1.3625 -0.005)
(0 1.3375 -0.005)
(0 1.3125 -0.005)
...
)
;
    }
    baffle
    {
        type            calculated;
        value           nonuniform List<vector> 
98
(
(0.675 0.987391 -0.005)
(0.675 0.962174 -0.005)
(0.675 0.936957 -0.005)
(0.675 0.911739 -0.005)
(0.675 0.886522 -0.005)
(0.675 0.861304 -0.005)
(0.675 0.836087 -0.005)
(0.675 0.81087 -0.005)
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
